baseCases/wire/constant/solution2/thermophysicalProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object thermophysicalProperties;
}

mixture
{
  equationOfState
  {
    rho rho         [ 1 -3 0 0 0 0 0 ]         2316.344885357538 ;
  }
  transport
  {
    flagMedium 0;
    lambda lambda         [ 1 1 -3 -1 0 0 0 ]         0.3101961263894601 ;
    TDiff TDiff         [ 0 2 -1 0 0 0 0 ]         1.539176113273081e-07 ;
    cwDiff cwDiff         [ 0 2 -1 0 0 0 0 ]         6.686637706393472e-10 ;
    p0 p0         [ 1 -1 -2 0 0 0 0 ]         100000.0 ;
    nu nu         [ 0 2 -1 0 0 0 0 ]         3.9231110470932035e-05 ;
  }
  vaporPressureFit
  {
    k0A k0A         [ 0 0 0 0 0 0 0 ]         13.3790476 ;
    k1A k1A         [ 0 0 0 0 0 0 0 ]         12.7189268 ;
    k2A k2A         [ 0 0 0 0 0 0 0 ]         -12.1799427 ;
    k3A k3A         [ 0 0 0 0 0 0 0 ]         0 ;
    k0B k0B         [ 0 0 0 1 0 0 0 ]         3954.58129 ;
    k1B k1B         [ 0 0 0 1 0 0 0 ]         8865.3778 ;
    k2B k2B         [ 0 0 0 1 0 0 0 ]         -1903.28499 ;
    k3B k3B         [ 0 0 0 1 0 0 0 ]         0 ;
    k0C k0C         [ 0 0 0 1 0 0 0 ]         102.517469 ;
    k1C k1C         [ 0 0 0 1 0 0 0 ]         350.866545 ;
    k2C k2C         [ 0 0 0 1 0 0 0 ]         0 ;
    k3C k3C         [ 0 0 0 1 0 0 0 ]         0 ;
    D D         [ 1 -1 -2 0 0 0 0 ]         0 ;
  }
}



// ************************************************************************* //
