baseCases/wire/0/air/pw
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0/air";
 object pw;
}

dimensions [ 1 -1 -2 0 0 0 0 ];

internalField uniform 751.2896498490958;

boundaryField
{
  inlet
  {
    type calculated;
    value $internalField;
  }
  outlet
  {
    type calculated;
    value $internalField;
  }
  top_bottom
  {
    type calculated;
    value $internalField;
  }
  air_to_solution1
  {
    type calculated;
    value $internalField;
  }
  air_to_solution2
  {
    type calculated;
    value $internalField;
  }
  wire
  {
    type calculated;
    value $internalField;
  }
  wall
  {
    type calculated;
    value $internalField;
  }
  symmetry
  {
    type symmetry;
  }
} 	// ************************************************************************* //

