baseCases/wire/system/air/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
  default Euler;
}

gradSchemes
{
  default cellMDLimited Gauss linear 0;
  grad(U) cellMDLimited Gauss linear 0.333;
}
divSchemes
{
  div(phi,U) Gauss linearUpwind grad(U);
  div(phi,omega) Gauss linearUpwind default;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
  div(phi,cw) bounded Gauss linearUpwind default;
  div(phi,T) bounded Gauss linearUpwind default;
}

laplacianSchemes
{
  default Gauss linear limited 1.0;
}
snGradSchemes
{
  default limited 1.0;
}

interpolationSchemes
{
  default         linear;
}

fluxRequired
{
  p;
}

// ************************************************************************* //
