baseCases/wire/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

PIMPLE
{
    nOuterCorrectors 15;

    outerCorrectorResidualControl
    {
        U       
        {
            tolerance   1e-3;
            relTol      0;
        }
        p       
        {
            tolerance   1e-5;
            relTol      0;
        }
    }
}

heatMassTransfer
{
    nHeatMassIter       200;
}

// ************************************************************************* //
