baseCases/wire/system/solution1/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/air";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(T|cw)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0;
    }
}

SIMPLE
{
}

PIMPLE
{
}

HMT
{
    residualControl
    {
        T           1e-6;
        cw          1e-6; 
    }
}

relaxationFactors
{
    fields
    {
    }

    equations
    {
		".*" 1;
    }
}


// ************************************************************************* //
